 #N = int(input("Введіть натуральне число N: "))
#total_sum = 0
#count = 0
#for i in range(1, N + 1):
#    if i % 3 == 0 or i % 5 == 0:
#        total_sum += i
#        count += 1
#print(f"Кількість: {count}")
#print(f"Сума: {total_sum}")
#if count > 0:
#    average = total_sum / count
#    print(f"Середнє: {average:.2f}")

#Контрольні Запитання
#8.for використовують типу коли ми знаємо заздлегіть кількість повторень, а while коли незнаємо.
#9.бо функція range() вміщає в себе перше число включно ,а останє не включає.
#10.start це початкове значеня діапозону
#stop кінцева межа діапозону
#step крок діапазону
#12.break повностю зупиняє роботу циклу і затім виходить з нього
#continue зупиняє роботу саме того кроку після якого написано continue і їде далі